In [ ]:
# At this technique we delete the NAN values
# from the dataset

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [6]:
data = {'gender': ['Male', np.nan, 'Male', 'Female', np.nan, 'Male', 'Female']}
dataset = pd.DataFrame(data)

In [7]:
dataset.head()

   gender
0    Male
1     NaN
2    Male
3  Female
4     NaN

In [8]:
dataset.dropna(inplace=True)

In [9]:
dataset.head()

   gender
0    Male
2    Male
3  Female
5    Male
6  Female